// створіть Zustand-стор, який зберігає інформацію про користувача (user) та булеве значення isAuthenticated. Стор має методи setUser для запису даних користувача після успішного логіну та clearIsAuthenticated для очищення стану під час виходу. Це дозволить в будь-якому компоненті отримувати актуальний стан авторизації.

// Під час створення Zustand-стору в TypeScript використовуйте подвійні дужки після create, інакше типи визначаться некоректно. Наприклад:

// create<AuthStore>()((set) => ({ ... }))
